Revit 2026 API
RebarContainer.AppendItemFromCurves Method
Overload List
Name | Description
AppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | Obsolete.
AppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean)
Top
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace